Revit 2024 API
DoorEvacuationExitType Enumeration
 An enumerated type listing the possible door evacuation types
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public enum DoorEvacuationExitType
Visual Basic
Public Enumeration DoorEvacuationExitType
Visual C++
public enum class DoorEvacuationExitType
Members
Member name | Description
ExteriorExit |  Exterior exit door.
InteriorExit |  Interior exit door.
InteriorPassage |  Interior passage door.
None |  Not used for exit access.
See Also
Autodesk.Revit.DB Namespace